/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_swap.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: taehooki <taehooki@student.42seoul.>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/01/17 10:04:24 by taehooki          #+#    #+#             */
/*   Updated: 2022/01/17 10:04:27 by taehooki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


void ft_swap(int *a, int *b)
{
    int tmp;//int형의 값을 저장하기 위해

    tmp = *a;//a의 값을 불러와서 tmp에 저장함
    *a = *b;//a의 포인터에 b의 값을 저장함
    *b = tmp;
}